micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_pwr_ex.h
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_pwr_ex.h
  * @author  MCD Application Team
  * @brief   Header file of PWR HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32N6xx_HAL_PWR_EX_H
#define STM32N6xx_HAL_PWR_EX_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal_def.h"


/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

/** @addtogroup PWREx
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup PWREx_Exported_Types PWR Extended Exported Types
  * @{
  */
/**
  * @brief  PWREx Wakeup pin configuration structure definition
  */
typedef struct
{
  uint32_t WakeUpPin;   /*!< Specifies the Wake-Up pin to be enabled.
                             This parameter can be a value of @ref PWR_WakeUp_Pins  */

  uint32_t PinPolarity; /*!< Specifies the Wake-Up pin polarity.
                             This parameter can be a value of @ref PWR_PIN_Polarity */

  uint32_t PinPull;     /*!< Specifies the Wake-Up pin pull.
                             This parameter can be a value of @ref PWR_PIN_Pull     */
} PWREx_WakeupPinTypeDef;

/**
  * @brief  PWR PVM configuration structure definition
  */
typedef struct
{
  uint32_t PVMType;   /*!< Specifies which voltage is monitored.
                           This parameter can be a value of
                           @ref PWREx_PVM_Type.                               */

  uint32_t Mode;      /*!< Specifies the operating mode for the selected pins.
                           This parameter can be a value of
                           @ref PWREx_PVM_Mode.                               */
} PWR_PVMTypeDef;


/**
  * @brief  PWR VddCORE monitoring configuration structure definition
  */
typedef struct
{
  uint32_t LowVoltageThreshold;   /*!< Specifies the VDDCORE voltage detector low-level.
                                       This parameter can be a value of
                                       @ref PWREx_VDDCORE_Levels.                          */

  uint32_t Mode;                  /*!< Specifies the operating mode for the selected pins.
                                       This parameter can be a value of
                                       @ref PWREx_VddCOREVM_Mode.                          */
} PWR_VddCOREVMTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup PWREx_Exported_Constants PWR Extended Exported Constants
  * @{
  */

/** @defgroup PWREx_Supply_configuration PWREx Supply configuration
  * @{
  */
#define PWR_SMPS_SUPPLY                PWR_CR1_SDEN                            /*!< VCORE power domains are supplied from SMPS step-down converter according to VOS */
#define PWR_EXTERNAL_SOURCE_SUPPLY     (0U)                                    /*!< SMPS step-down converter disabled. VCORE supplied from external source          */

#define PWR_SUPPLY_CONFIG_MASK         PWR_CR1_SDEN
/**
  * @}
  */

/** @defgroup PWR_Regulator_Voltage_Scale PWR Regulator Voltage Scale
  * @{
  */
#define PWR_REGULATOR_VOLTAGE_SCALE0   PWR_VOSCR_VOS                           /*!< Voltage scaling range 0 (highest frequency) */
#define PWR_REGULATOR_VOLTAGE_SCALE1   (0U)                                    /*!< Voltage scaling range 1 (lowest power)      */
/**
  * @}
  */

/** @defgroup PWREx_Regulator_Voltage_Scale PWREx Regulator Voltage Scale
  * @{
  */
#define PWR_REGULATOR_STOP_VOLTAGE_SCALE3    PWR_CPUCR_SVOS                    /*!< System Stop mode voltage scaling range 3 (highest frequency) */
#define PWR_REGULATOR_STOP_VOLTAGE_SCALE5    (0U)                              /*!< System Stop mode voltage scaling range 5 (lowest power)      */
/**
  * @}
  */

/** @defgroup PWREx_VBAT_Thresholds PWREx VBAT Thresholds
  * @{
  */
#define PWR_VBAT_BETWEEN_HIGH_LOW_THRESHOLD    (0U)
#define PWR_VBAT_BELOW_LOW_THRESHOLD           PWR_BDCR1_VBATL
#define PWR_VBAT_ABOVE_HIGH_THRESHOLD          PWR_BDCR1_VBATH
/**
  * @}
  */

/** @defgroup PWREx_TEMP_Thresholds PWREx Temperature Thresholds
  * @{
  */
#define PWR_TEMP_BETWEEN_HIGH_LOW_THRESHOLD  (0U)
#define PWR_TEMP_BELOW_LOW_THRESHOLD         PWR_BDCR1_TEMPL
#define PWR_TEMP_ABOVE_HIGH_THRESHOLD        PWR_BDCR1_TEMPH
/**
  * @}
  */

/** @defgroup PWREx_VDDCORE_Levels PWREx VDDCORE voltage detector low-level
  * @{
  */
#define PWR_VDDCORE_THRESHOLD_VOS0     PWR_CR3_VCORELLS
#define PWR_VDDCORE_THRESHOLD_VOS1     (0U)
/**
  * @}
  */

/** @defgroup PWREx_VDDCORE_Thresholds PWREx VDDCORE voltage detector low-level Thresholds
  * @{
  */
#define PWR_VDDCORE_BETWEEN_HIGH_LOW_THRESHOLD  (0U)
#define PWR_VDDCORE_BELOW_LOW_THRESHOLD         PWR_CR3_VCOREL
#define PWR_VDDCORE_ABOVE_HIGH_THRESHOLD        PWR_CR3_VCOREH
/**
  * @}
  */

/** @defgroup PWREx_VddCOREVM_Mode PWR Extended VddCORE Monitoring Interrupt and Event Mode
  * @{
  */
#define PWR_VDDCOREVM_MODE_NORMAL               (0x00U)                        /*!< Basic Mode is used                                                 */
#define PWR_VDDCOREVM_MODE_IT_RISING            (0x05U)                        /*!< External Interrupt Mode with Rising edge trigger detection         */
#define PWR_VDDCOREVM_MODE_IT_FALLING           (0x06U)                        /*!< External Interrupt Mode with Falling edge trigger detection        */
#define PWR_VDDCOREVM_MODE_IT_RISING_FALLING    (0x07U)                        /*!< External Interrupt Mode with Rising/Falling edge trigger detection */
#define PWR_VDDCOREVM_MODE_EVENT_RISING         (0x09U)                        /*!< Event Mode with Rising edge trigger detection                      */
#define PWR_VDDCOREVM_MODE_EVENT_FALLING        (0x0AU)                        /*!< Event Mode with Falling edge trigger detection                     */
#define PWR_VDDCOREVM_MODE_EVENT_RISING_FALLING (0x0BU)                        /*!< Event Mode with Rising/Falling edge trigger detection              */
/**
  * @}
  */

/** @defgroup PWREx_VDDIO PWREx Vdd IO selection
  * @{
  */
#define PWR_VDDIO                      (0U)
#define PWR_VDDIO2                     (1U)
#define PWR_VDDIO3                     (2U)
#define PWR_VDDIO4                     (3U)
#define PWR_VDDIO5                     (4U)
/**
  * @}
  */

/** @defgroup PWREx_VDDIO_Range PWREx Vdd IO Range
  * @{
  */
#define PWR_VDDIO_RANGE_3V3            (0U)
#define PWR_VDDIO_RANGE_1V8            (1U)
/**
  * @}
  */

/** @defgroup PWREx_PVM_Mode PWR Extended PVM Interrupt and Event Mode
  * @{
  */
#define PWR_PVM_MODE_NORMAL               (0x00U)                              /*!< Basic Mode is used                                                 */
#define PWR_PVM_MODE_IT_RISING            (0x05U)                              /*!< External Interrupt Mode with Rising edge trigger detection         */
#define PWR_PVM_MODE_IT_FALLING           (0x06U)                              /*!< External Interrupt Mode with Falling edge trigger detection        */
#define PWR_PVM_MODE_IT_RISING_FALLING    (0x07U)                              /*!< External Interrupt Mode with Rising/Falling edge trigger detection */
#define PWR_PVM_MODE_EVENT_RISING         (0x09U)                              /*!< Event Mode with Rising edge trigger detection                      */
#define PWR_PVM_MODE_EVENT_FALLING        (0x0AU)                              /*!< Event Mode with Falling edge trigger detection                     */
#define PWR_PVM_MODE_EVENT_RISING_FALLING (0x0BU)                              /*!< Event Mode with Rising/Falling edge trigger detection              */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup PWREx_Exported_Macros PWR Extended Exported Macros
  * @{
  */

/**
  * @brief  Enable the USBVM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Disable the USBVM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Enable the USBVM Event Line.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Disable the USBVM Event Line.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Enable the USBVM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Disable the USBVM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Enable the USBVM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Disable the USBVM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Enable the USBVM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                    \
  {                                                     \
    __HAL_PWR_USBVM_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_USBVM_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the USBVM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                     \
  {                                                      \
    __HAL_PWR_USBVM_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_USBVM_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on USBVM EXTI Line.
  * @retval None
  */
#define __HAL_PWR_USBVM_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Check whether the specified USBVM EXTI flag is set or not.
  * @retval EXTI USBVM Line Status.
  */
#define __HAL_PWR_USBVM_EXTI_GET_FLAG() ((EXTI->RPR3 | EXTI->FPR3) & PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Clear the USBVM interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_USBVM_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Clear the USBVM interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_USBVM_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR3, PWR_EXTI_LINE_PVM_VDDUSB)

/**
  * @brief  Enable the IO2VM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Disable the IO2VM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Enable the IO2VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Disable the IO2VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Enable the IO2VM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Disable the IO2VM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Enable the IO2VM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Disable the IO2VM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Enable the IO2VM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                      \
  {                                                       \
    __HAL_PWR_IO2VM_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_IO2VM_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the IO2VM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                       \
  {                                                        \
    __HAL_PWR_IO2VM_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_IO2VM_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on IO2VM EXTI Line.
  * @retval None
  */
#define __HAL_PWR_IO2VM_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Check whether the specified IO2VM EXTI flag is set or not.
  * @retval EXTI IO2VM Line Status.
  */
#define __HAL_PWR_IO2VM_EXTI_GET_FLAG() ((EXTI->RPR3 | EXTI->FPR3) & PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Clear the IO2VM interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_IO2VM_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Clear the IO2VM interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_IO2VM_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR3, PWR_EXTI_LINE_PVM_VDDIO2)

/**
  * @brief  Enable the IO3VM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Disable the IO3VM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Enable the IO3VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Disable the IO3VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Enable the IO3VM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Disable the IO3VM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Enable the IO3VM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Disable the IO3VM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Enable the IO3VM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                      \
  {                                                       \
    __HAL_PWR_IO3VM_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_IO3VM_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the IO3VM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                       \
  {                                                        \
    __HAL_PWR_IO3VM_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_IO3VM_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on IO3VM EXTI Line.
  * @retval None
  */
#define __HAL_PWR_IO3VM_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Check whether the specified IO3VM EXTI flag is set or not.
  * @retval EXTI IO3VM Line Status.
  */
#define __HAL_PWR_IO3VM_EXTI_GET_FLAG() ((EXTI->RPR3 | EXTI->FPR3) & PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Clear the IO3VM interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_IO3VM_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Clear the IO3VM interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_IO3VM_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR3, PWR_EXTI_LINE_PVM_VDDIO3)

/**
  * @brief  Enable the IO4VM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Disable the IO4VM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Enable the IO4VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Disable the IO4VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Enable the IO4VM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Disable the IO4VM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Enable the IO4VM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Disable the IO4VM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Enable the IO4VM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                      \
  {                                                       \
    __HAL_PWR_IO4VM_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_IO4VM_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the IO4VM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                       \
  {                                                        \
    __HAL_PWR_IO4VM_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_IO4VM_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on IO4VM EXTI Line.
  * @retval None
  */
#define __HAL_PWR_IO4VM_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Check whether the specified IO4VM EXTI flag is set or not.
  * @retval EXTI IO4VM Line Status.
  */
#define __HAL_PWR_IO4VM_EXTI_GET_FLAG() ((EXTI->RPR3 | EXTI->FPR3) & PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Clear the IO4VM interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_IO4VM_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Clear the IO4VM interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_IO4VM_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR3, PWR_EXTI_LINE_PVM_VDDIO4)

/**
  * @brief  Enable the IO5VM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Disable the IO5VM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Enable the IO5VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Disable the IO5VM Event Line.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Enable the IO5VM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Disable the IO5VM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Enable the IO5VM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Disable the IO5VM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Enable the IO5VM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                      \
  {                                                       \
    __HAL_PWR_IO5VM_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_IO5VM_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the IO5VM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                       \
  {                                                        \
    __HAL_PWR_IO5VM_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_IO5VM_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on IO5VM EXTI Line.
  * @retval None
  */
#define __HAL_PWR_IO5VM_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Check whether the specified IO5VM EXTI flag is set or not.
  * @retval EXTI IO5VM Line Status.
  */
#define __HAL_PWR_IO5VM_EXTI_GET_FLAG() ((EXTI->RPR3 | EXTI->FPR3) & PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Clear the IO5VM interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_IO5VM_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Clear the IO5VM interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_IO5VM_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR3, PWR_EXTI_LINE_PVM_VDDIO5)

/**
  * @brief  Enable the ADCVM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Disable the ADCVM Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR3, PWR_EXTI_LINE_PVM_VDDA)

