micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_pwr_ex.h
/**
  * @brief  Enable the ADCVM Event Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Disable the ADCVM Event Line.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Enable the ADCVM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Disable the ADCVM Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Enable the ADCVM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Disable the ADCVM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Enable the ADCVM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                    \
  {                                                     \
    __HAL_PWR_ADCVM_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_ADCVM_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the ADCVM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                     \
  {                                                      \
    __HAL_PWR_ADCVM_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_ADCVM_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on ADCVM EXTI Line.
  * @retval None
  */
#define __HAL_PWR_ADCVM_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Check whether the specified ADCVM EXTI flag is set or not.
  * @retval EXTI ADCVM Line Status.
  */
#define __HAL_PWR_ADCVM_EXTI_GET_FLAG() ((EXTI->RPR3 | EXTI->FPR3) & PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Clear the ADCVM interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_ADCVM_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Clear the ADCVM interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_ADCVM_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR3, PWR_EXTI_LINE_PVM_VDDA)

/**
  * @brief  Enable the VddCORE monitoring Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_ENABLE_IT() SET_BIT(EXTI->IMR3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Disable the VddCORE monitoring Extended Interrupt Line.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI->IMR3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Enable the VddCORE monitoring Event Line.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_ENABLE_EVENT() SET_BIT(EXTI->EMR3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Disable the VddCORE monitoring Event Line.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_DISABLE_EVENT() CLEAR_BIT(EXTI->EMR3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Enable the VddCORE monitoring Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_ENABLE_RISING_EDGE() SET_BIT(EXTI->RTSR3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Disable the VddCORE monitoring Extended Interrupt Rising Trigger.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_DISABLE_RISING_EDGE() CLEAR_BIT(EXTI->RTSR3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Enable the VddCORE monitoring Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_ENABLE_FALLING_EDGE() SET_BIT(EXTI->FTSR3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Disable the VddCORE monitoring Extended Interrupt Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_DISABLE_FALLING_EDGE() CLEAR_BIT(EXTI->FTSR3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Enable the VddCORE monitoring Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do                                                    \
  {                                                     \
    __HAL_PWR_VCOREVM_EXTI_ENABLE_RISING_EDGE();            \
    __HAL_PWR_VCOREVM_EXTI_ENABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Disable the VddCORE monitoring Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do                                                     \
  {                                                      \
    __HAL_PWR_VCOREVM_EXTI_DISABLE_RISING_EDGE();            \
    __HAL_PWR_VCOREVM_EXTI_DISABLE_FALLING_EDGE();           \
  } while(0)

/**
  * @brief  Generate a Software Interrupt on VddCORE monitoring EXTI Line.
  * @retval None
  */
#define __HAL_PWR_VCOREVM_EXTI_GENERATE_SWIT() SET_BIT(EXTI->SWIER3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Check whether the specified VddCORE monitoring EXTI flag is set or not.
  * @retval EXTI VddCORE monitoring Line Status.
  */
#define __HAL_PWR_VCOREVM_EXTI_GET_FLAG() ((EXTI->RPR3 | EXTI->FPR3) & PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Clear the VddCORE monitoring interrupt Rising flag.
  * @retval None.
  */
#define __HAL_PWR_VCOREVM_EXTI_CLEAR_RISING_FLAG() WRITE_REG(EXTI->RPR3, PWR_EXTI_LINE_VCOREVM)

/**
  * @brief  Clear the VddCORE monitoring interrupt Falling flag.
  * @retval None
  */
#define __HAL_PWR_VCOREVM_EXTI_CLEAR_FALLING_FLAG() WRITE_REG(EXTI->FPR3, PWR_EXTI_LINE_VCOREVM)
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @addtogroup PWREx_Exported_Functions PWR Extended Exported Functions
  * @{
  */

