micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_pwr_ex.h
/** @addtogroup PWREx_Exported_Functions_Group1 Power Supply Control Functions
  * @{
  */
/* Power supply control functions */
HAL_StatusTypeDef HAL_PWREx_ConfigSupply(uint32_t SupplySource);
uint32_t          HAL_PWREx_GetSupplyConfig(void);

/* Power voltage scaling functions */
HAL_StatusTypeDef HAL_PWREx_ControlVoltageScaling(uint32_t VoltageScaling);
uint32_t          HAL_PWREx_GetVoltageRange(void);
void              HAL_PWREx_ControlStopModeVoltageScaling(uint32_t VoltageScaling);
uint32_t          HAL_PWREx_GetStopModeVoltageRange(void);


/** @addtogroup PWREx_Exported_Functions_Group2 Wakeup Pins configuration functions
  * @{
  */
/* Wakeup Pins control functions */
void HAL_PWREx_EnableWakeUpPin(const PWREx_WakeupPinTypeDef *sPinParams);
/**
  * @}
  */


/** @addtogroup PWREx_Exported_Functions_Group3 Memories Retention Functions
  * @{
  */
void HAL_PWREx_EnableBkupRAMRetention(void);
void HAL_PWREx_DisableBkupRAMRetention(void);
void HAL_PWREx_EnableTCMRetention(void);
void HAL_PWREx_DisableTCMRetention(void);
void HAL_PWREx_EnableTCMFLXRetention(void);
void HAL_PWREx_DisableTCMFLXRetention(void);
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group4 Low Power Control Functions
  * @{
  */
void     HAL_PWREx_SetPulseLow(uint32_t Pulselowtime);
uint32_t HAL_PWREx_GetPulseLow(void);
void     HAL_PWREx_EnableSMPSPWM(void);
void     HAL_PWREx_DisableSMPSPWM(void);
void     HAL_PWREx_EnablePullDownOutput(void);
void     HAL_PWREx_DisablePullDownOutput(void);
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group5 Power Monitoring functions
  * @{
  */
/* Power VBAT/Temperature monitoring functions */
void              HAL_PWREx_EnableMonitoring(void);
void              HAL_PWREx_DisableMonitoring(void);
uint32_t          HAL_PWREx_GetTemperatureLevel(void);
uint32_t          HAL_PWREx_GetVBATLevel(void);
void              HAL_PWREx_EnableVDDCOREMonitoring(void);
void              HAL_PWREx_DisableVDDCOREMonitoring(void);
void              HAL_PWREx_ConfigVDDCOREVM(const PWR_VddCOREVMTypeDef *pConfigVddCOREVM);
uint32_t          HAL_PWREx_GetVDDCORELevel(void);
void              HAL_PWREx_ConfigVddIORange(uint32_t VddIOPort, uint32_t VoltageRange);
uint32_t          HAL_PWREx_GetVddIORange(uint32_t VddIOPort);
void              HAL_PWREx_EnableVddIO4RangeSTBY(void);
void              HAL_PWREx_DisableVddIO4RangeSTBY(void);
void              HAL_PWREx_EnableVddIO5RangeSTBY(void);
void              HAL_PWREx_DisableVddIO5RangeSTBY(void);
void              HAL_PWREx_EnableVddUSB(void);
void              HAL_PWREx_DisableVddUSB(void);
void              HAL_PWREx_EnableVddIO2(void);
void              HAL_PWREx_DisableVddIO2(void);
void              HAL_PWREx_EnableVddIO3(void);
void              HAL_PWREx_DisableVddIO3(void);
void              HAL_PWREx_EnableVddIO4(void);
void              HAL_PWREx_DisableVddIO4(void);
void              HAL_PWREx_EnableVddIO5(void);
void              HAL_PWREx_DisableVddIO5(void);
void              HAL_PWREx_EnableVddA(void);
void              HAL_PWREx_DisableVddA(void);
void              HAL_PWREx_EnableVddUSBVMEN(void);
void              HAL_PWREx_DisableVddUSBVMEN(void);
void              HAL_PWREx_EnableVddIO2VMEN(void);
void              HAL_PWREx_DisableVddIO2VMEN(void);
void              HAL_PWREx_EnableVddIO3VMEN(void);
void              HAL_PWREx_DisableVddIO3VMEN(void);
void              HAL_PWREx_EnableVddIO4VMEN(void);
void              HAL_PWREx_DisableVddIO4VMEN(void);
void              HAL_PWREx_EnableVddIO5VMEN(void);
void              HAL_PWREx_DisableVddIO5VMEN(void);
void              HAL_PWREx_EnableVddAVMEN(void);
void              HAL_PWREx_DisableVddAVMEN(void);
HAL_StatusTypeDef HAL_PWREx_ConfigPVM(const PWR_PVMTypeDef *pConfigPVM);
void              HAL_PWREx_PVD_PVM_IRQHandler(void);
void              HAL_PWREx_VDDCORE_Rising_Callback(void);
void              HAL_PWREx_VDDCORE_Falling_Callback(void);
void              HAL_PWREx_USBVM_Rising_Callback(void);
void              HAL_PWREx_USBVM_Falling_Callback(void);
void              HAL_PWREx_IO2VM_Rising_Callback(void);
void              HAL_PWREx_IO2VM_Falling_Callback(void);
void              HAL_PWREx_IO3VM_Rising_Callback(void);
void              HAL_PWREx_IO3VM_Falling_Callback(void);
void              HAL_PWREx_IO4VM_Rising_Callback(void);
void              HAL_PWREx_IO4VM_Falling_Callback(void);
void              HAL_PWREx_IO5VM_Rising_Callback(void);
void              HAL_PWREx_IO5VM_Falling_Callback(void);
void              HAL_PWREx_ADCVM_Rising_Callback(void);
void              HAL_PWREx_ADCVM_Falling_Callback(void);
/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/


/** @defgroup PWREx_VDDCOREVM_EXTI PWR VddCORE monitoring  extended interrupts and event lines defines
  * @{
  */
#define PWR_EXTI_LINE_VCOREVM          EXTI_IMR3_IM68                          /*!< VddCORE monitoring EXTI Line */
/**
  * @}
  */

/** @defgroup PWREx_PVM_EXTI PWR PVM extended interrupts and event lines defines
  * @{
  */
#define PWR_EXTI_LINE_PVM_VDDIO2       EXTI_IMR3_IM69                          /*!< PVM VDDIO2 EXTI Line  */
#define PWR_EXTI_LINE_PVM_VDDIO3       EXTI_IMR3_IM70                          /*!< PVM VDDIO3 EXTI Line  */
#define PWR_EXTI_LINE_PVM_VDDIO4       EXTI_IMR3_IM71                          /*!< PVM VDDIO4 EXTI Line  */
#define PWR_EXTI_LINE_PVM_VDDIO5       EXTI_IMR3_IM72                          /*!< PVM VDDIO5 EXTI Line  */
#define PWR_EXTI_LINE_PVM_VDDUSB       EXTI_IMR3_IM73                          /*!< PVM VDD USB EXTI Line */
#define PWR_EXTI_LINE_PVM_VDDA         EXTI_IMR3_IM74                          /*!< PVM VDD ADC EXTI Line */
/**
  * @}
  */

/** @defgroup PWREx_PVM_Type PWR Extended Voltage Monitoring Type
  * @{
  */
#define PWR_VDDUSB_VM                  (0U)                                    /*!< Independent USB voltage monitor    */
#define PWR_VDDIO2_VM                  (1U)                                    /*!< Independent VDDIO2 voltage monitor */
#define PWR_VDDIO3_VM                  (2U)                                    /*!< Independent VDDIO3 voltage monitor */
#define PWR_VDDIO4_VM                  (3U)                                    /*!< Independent VDDIO4 voltage monitor */
#define PWR_VDDIO5_VM                  (4U)                                    /*!< Independent VDDIO5 voltage monitor */
#define PWR_VDDA_VM                    (5U)                                    /*!< Independent VDDA voltage monitor   */
/**
  * @}
  */

