micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_pwr_ex.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup PWREx_Private_Macros PWREx Private Macros
  * @{
  */
/** @defgroup PWREx_IS_PWR_Definitions PWREx Private macros to check input parameters
  * @{
  */
/* Check PWR regulator configuration parameter */
#define IS_PWR_SUPPLY(__SOURCE__) (((__SOURCE__) == PWR_SMPS_SUPPLY)             ||\
                                   ((__SOURCE__) == PWR_EXTERNAL_SOURCE_SUPPLY))

/* Check low power regulator parameter */
#define IS_PWR_REGULATOR(__REGULATOR__) ((__REGULATOR__) == PWR_MAINREGULATOR_ON)

/* Check voltage scale level parameter */
#define IS_PWR_REGULATOR_VOLTAGE(__VOLTAGE__) (((__VOLTAGE__) == PWR_REGULATOR_VOLTAGE_SCALE0) || \
                                               ((__VOLTAGE__) == PWR_REGULATOR_VOLTAGE_SCALE1))

/* Check PWR regulator configuration in STOP mode parameter */
#define IS_PWR_STOP_MODE_REGULATOR_VOLTAGE(__VOLTAGE__) (((__VOLTAGE__) == PWR_REGULATOR_STOP_VOLTAGE_SCALE3)  ||\
                                                         ((__VOLTAGE__) == PWR_REGULATOR_STOP_VOLTAGE_SCALE5))

/* Check PWR pulse low time configuration parameter */
#define IS_PWR_PULSE_LOW_TIME(__LOWTIME__) ((__LOWTIME__) <= 31U)

/* Check VDDCORE voltage detector low-level parameter */
#define IS_PWR_VDDCOREVM_LEVEL(__LEVEL__) (((__LEVEL__) == PWR_VDDCORE_THRESHOLD_VOS0) || \
                                           ((__LEVEL__) == PWR_VDDCORE_THRESHOLD_VOS1))

/* Check VddCORE VM mode check parameter */
#define IS_PWR_VDDCOREVM_MODE(__MODE__)                     \
  (((__MODE__) == PWR_VDDCOREVM_MODE_NORMAL)              ||\
   ((__MODE__) == PWR_VDDCOREVM_MODE_IT_RISING)           ||\
   ((__MODE__) == PWR_VDDCOREVM_MODE_IT_FALLING)          ||\
   ((__MODE__) == PWR_VDDCOREVM_MODE_IT_RISING_FALLING)   ||\
   ((__MODE__) == PWR_VDDCOREVM_MODE_EVENT_RISING)        ||\
   ((__MODE__) == PWR_VDDCOREVM_MODE_EVENT_FALLING)       ||\
   ((__MODE__) == PWR_VDDCOREVM_MODE_EVENT_RISING_FALLING))

/* Check PVM type parameter */
#define IS_PWR_PVM_TYPE(__TYPE__)  \
  (((__TYPE__) == PWR_VDDUSB_VM) ||\
   ((__TYPE__) == PWR_VDDIO2_VM) ||\
   ((__TYPE__) == PWR_VDDIO3_VM) ||\
   ((__TYPE__) == PWR_VDDIO4_VM) ||\
   ((__TYPE__) == PWR_VDDIO5_VM) ||\
   ((__TYPE__) == PWR_VDDA_VM))

/* Check PVM mode check parameter */
#define IS_PWR_PVM_MODE(__MODE__)                   \
  (((__MODE__) == PWR_PVM_MODE_NORMAL)            ||\
   ((__MODE__) == PWR_PVM_MODE_IT_RISING)         ||\
   ((__MODE__) == PWR_PVM_MODE_IT_FALLING)        ||\
   ((__MODE__) == PWR_PVM_MODE_IT_RISING_FALLING) ||\
   ((__MODE__) == PWR_PVM_MODE_EVENT_RISING)      ||\
   ((__MODE__) == PWR_PVM_MODE_EVENT_FALLING)     ||\
   ((__MODE__) == PWR_PVM_MODE_EVENT_RISING_FALLING))

/* Check the VddIO parameter */
#define IS_PWR_VDDIO(__VDDIO__)  (((__VDDIO__) == PWR_VDDIO)  || \
                                  ((__VDDIO__) == PWR_VDDIO2) || \
                                  ((__VDDIO__) == PWR_VDDIO3) || \
                                  ((__VDDIO__) == PWR_VDDIO4) || \
                                  ((__VDDIO__) == PWR_VDDIO5))

/* Check the VddIO Range parameter */
#define IS_PWR_VDDIO_RANGE(__RANGE__)  (((__RANGE__) == PWR_VDDIO_RANGE_3V3) || \
                                        ((__RANGE__) == PWR_VDDIO_RANGE_1V8))

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif /* STM32N6xx_HAL_PWR_EX_H */

